frontend/controllers/ScheduleController.php

SELECT * FROM `schedule`
INSERT INTO `schedule` (`class_id`, `date`, `trainer_id`) VALUES (2, 1517778000, 1)
---
    public function actionCreate() {
        $newRawSchedule = new Schedule();
        if ($newRawSchedule->load(Yii::$app->request->post())) {
            $newRawSchedule->trainer_id = 1;
            $newRawSchedule->save();

SELECT * FROM `schedule` ORDER BY `id` DESC
---
    protected function getModel() {
        if (($model = Schedule::find()->with('class', 'trainer')->orderBy('id DESC')->all()) !== null) {