frontend/views/schedule/_formClients.php

    'header' => '<b>Assign clients</b>'
]);

$allClient = ClientSchedule::find()
        ->select('user_id')
        ->where(['schedule_id' => $id])
        ->asArray()
        ->all();

$model = new ClientSchedule();
$users = User::find()
                ->select('*')
                ->where(['type' => User::TYPE_CUSTOMER])
                ->andWhere(['not in', 'id', ArrayHelper::getColumn($allClient, 'user_id')])->all()
---
SELECT `user_id` FROM `client_schedule` WHERE `schedule_id`=27
SELECT * FROM `user` WHERE (`type`=2) AND (`id` NOT IN (NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL))