frontend/views/schedule/index.php

        ?>
    </p>

    <?= Yii::$app->controller->renderPartial('/schedule/_formSchedule', ['model' => new Schedule(), 'lesson' => Lesson::find()->all()]); ?>
---
SELECT * FROM `lesson`

                    </td>
                    <td>
                        <?php
                        $model = Lesson::findOne($value->class_id);
---
SELECT * FROM `lesson` WHERE `id`=2