common/models/Schedule.php

SELECT * FROM `client_schedule` WHERE `schedule_id`=27
SELECT * FROM `user` WHERE `id` IN (54, 59)
---
    protected function getClients($scheduleID) {
        return ClientSchedule::find()->with('user')->where(['schedule_id' => $scheduleID])->all();